In [1]:
import pandas as pd

In [2]:
train = pd.read_csv('train.csv', parse_dates=['Date'], low_memory=False)
display(train.head())

,Store,DayOfWeek,Date,Sales,Customers,Open,Promo,StateHoliday,SchoolHoliday
0,1,5,2015-07-31,5263,555,1,1,0,1
1,2,5,2015-07-31,6064,625,1,1,0,1
2,3,5,2015-07-31,8314,821,1,1,0,1
3,4,5,2015-07-31,13995,1498,1,1,0,1
4,5,5,2015-07-31,4822,559,1,1,0,1

In [3]:
# Drop DayOfWeek, StateHoliday, SchoolHoliday
train.drop(columns=['DayOfWeek', 'StateHoliday', 'SchoolHoliday'], inplace=True)
display(train.head())

   Store       Date  Sales  Customers  Open  Promo
0      1 2015-07-31   5263        555     1      1
1      2 2015-07-31   6064        625     1      1
2      3 2015-07-31   8314        821     1      1
3      4 2015-07-31  13995       1498     1      1
4      5 2015-07-31   4822        559     1      1

In [4]:
train = train[train['Open'] != 0]
train['Open'] = train['Open'].astype(bool)

train.drop(columns=['Open'], inplace=True)
display(train.head())

   Store       Date  Sales  Customers  Promo
0      1 2015-07-31   5263        555      1
1      2 2015-07-31   6064        625      1
2      3 2015-07-31   8314        821      1
3      4 2015-07-31  13995       1498      1
4      5 2015-07-31   4822        559      1

In [5]:
dataset = train.copy()

# Drop Open and Promo and save into a new csv file
dataset.drop(columns=['Promo'], inplace=True)
dataset.to_csv('new_data/dataset.csv', index=False)

In [6]:
store = pd.read_csv('store.csv', low_memory=False)
display(store.head())

,Store,StoreType,Assortment,CompetitionDistance,CompetitionOpenSinceMonth,CompetitionOpenSinceYear,Promo2,Promo2SinceWeek,Promo2SinceYear,PromoInterval
0,1,c,a,1270.0,9.0,2008.0,0,NaN,NaN,NaN
1,2,a,a,570.0,11.0,2007.0,1,13.0,2010.0,"Jan,Apr,Jul,Oct"
2,3,a,a,14130.0,12.0,2006.0,1,14.0,2011.0,"Jan,Apr,Jul,Oct"
3,4,c,c,620.0,9.0,2009.0,0,NaN,NaN,NaN
4,5,a,a,29910.0,4.0,2015.0,0,NaN,NaN,NaN

In [7]:
# Drop Storetype, CompetitionOpenSinceMonth, CompetitionOpenSinceYear columns
store.drop(columns=['StoreType', 'CompetitionOpenSinceMonth', 'CompetitionOpenSinceYear'], inplace=True)
display(store.head())

,Store,Assortment,CompetitionDistance,Promo2,Promo2SinceWeek,Promo2SinceYear,PromoInterval
0,1,a,1270.0,0,NaN,NaN,NaN
1,2,a,570.0,1,13.0,2010.0,"Jan,Apr,Jul,Oct"
2,3,a,14130.0,1,14.0,2011.0,"Jan,Apr,Jul,Oct"
3,4,c,620.0,0,NaN,NaN,NaN
4,5,a,29910.0,0,NaN,NaN,NaN

In [8]:
# Change 'a', 'b', 'c' of Assortment to "Small", "Medium", "Large"
store['Assortment'] = store['Assortment'].replace({'a': 'Small', 'b': 'Medium', 'c': 'Large'})
display(store.head())

,Store,Assortment,CompetitionDistance,Promo2,Promo2SinceWeek,Promo2SinceYear,PromoInterval
0,1,Small,1270.0,0,NaN,NaN,NaN
1,2,Small,570.0,1,13.0,2010.0,"Jan,Apr,Jul,Oct"
2,3,Small,14130.0,1,14.0,2011.0,"Jan,Apr,Jul,Oct"
3,4,Large,620.0,0,NaN,NaN,NaN
4,5,Small,29910.0,0,NaN,NaN,NaN

In [9]:
promo = store.copy()

store.drop(columns=['Promo2', 'PromoInterval', 'Promo2SinceYear', 'Promo2SinceWeek'], inplace=True)
display(store.head())
store.to_csv('new_data/stores.csv', index=False)

   Store Assortment  CompetitionDistance
0      1      Small               1270.0
1      2      Small                570.0
2      3      Small              14130.0
3      4      Large                620.0
4      5      Small              29910.0

In [10]:
display(promo.head())
display(train.head())

,Store,Assortment,CompetitionDistance,Promo2,Promo2SinceWeek,Promo2SinceYear,PromoInterval
0,1,Small,1270.0,0,NaN,NaN,NaN
1,2,Small,570.0,1,13.0,2010.0,"Jan,Apr,Jul,Oct"
2,3,Small,14130.0,1,14.0,2011.0,"Jan,Apr,Jul,Oct"
3,4,Large,620.0,0,NaN,NaN,NaN
4,5,Small,29910.0,0,NaN,NaN,NaN

   Store       Date  Sales  Customers  Promo
0      1 2015-07-31   5263        555      1
1      2 2015-07-31   6064        625      1
2      3 2015-07-31   8314        821      1
3      4 2015-07-31  13995       1498      1
4      5 2015-07-31   4822        559      1

In [11]:
# Delete all rows of promo with Promo2 = 0
print(promo.shape)
promo = promo[promo['Promo2'] != 0]
display(promo.head())
print(promo.shape)

(1115, 7)

,Store,Assortment,CompetitionDistance,Promo2,Promo2SinceWeek,Promo2SinceYear,PromoInterval
1,2,Small,570.0,1,13.0,2010.0,"Jan,Apr,Jul,Oct"
2,3,Small,14130.0,1,14.0,2011.0,"Jan,Apr,Jul,Oct"
10,11,Large,960.0,1,1.0,2012.0,"Jan,Apr,Jul,Oct"
11,12,Large,1070.0,1,13.0,2010.0,"Jan,Apr,Jul,Oct"
12,13,Small,310.0,1,45.0,2009.0,"Feb,May,Aug,Nov"

(571, 7)

In [12]:
promo.drop(columns=['Promo2', 'Assortment', 'Promo2', 'CompetitionDistance'], inplace=True)
display(promo.head())

    Store  Promo2SinceWeek  Promo2SinceYear    PromoInterval
1       2             13.0           2010.0  Jan,Apr,Jul,Oct
2       3             14.0           2011.0  Jan,Apr,Jul,Oct
10     11              1.0           2012.0  Jan,Apr,Jul,Oct
11     12             13.0           2010.0  Jan,Apr,Jul,Oct
12     13             45.0           2009.0  Feb,May,Aug,Nov

In [14]:
train.drop(columns=['Customers', 'Sales'], inplace=True)
display(train.head())

   Store       Date  Promo
0      1 2015-07-31      1
1      2 2015-07-31      1
2      3 2015-07-31      1
3      4 2015-07-31      1
4      5 2015-07-31      1

In [15]:
print(train.shape)
train = train[train['Promo'] == 1]
print(train.shape)

(844392, 3)
(376896, 3)

In [16]:
train.drop(columns=['Promo'], inplace=True)
train.to_csv('new_data/promotions.csv', index=False)

In [17]:
new_stores = pd.merge(store, promo, on='Store', how='left')
display(new_stores.head())

,Store,Assortment,CompetitionDistance,Promo2SinceWeek,Promo2SinceYear,PromoInterval
0,1,Small,1270.0,NaN,NaN,NaN
1,2,Small,570.0,13.0,2010.0,"Jan,Apr,Jul,Oct"
2,3,Small,14130.0,14.0,2011.0,"Jan,Apr,Jul,Oct"
3,4,Large,620.0,NaN,NaN,NaN
4,5,Small,29910.0,NaN,NaN,NaN

In [19]:
# Rename the columns
new_stores.rename(columns={'Promo2SinceWeek': 'PromoSinceWeek', 'Promo2SinceYear': 'PromoSinceYear'}, inplace=True)
display(new_stores.head())

,Store,Assortment,CompetitionDistance,PromoSinceWeek,PromoSinceYear,PromoInterval
0,1,Small,1270.0,NaN,NaN,NaN
1,2,Small,570.0,13.0,2010.0,"Jan,Apr,Jul,Oct"
2,3,Small,14130.0,14.0,2011.0,"Jan,Apr,Jul,Oct"
3,4,Large,620.0,NaN,NaN,NaN
4,5,Small,29910.0,NaN,NaN,NaN

In [20]:
new_stores.to_csv('new_data/stores.csv', index=False)